In [2]:
import pandas as pd

In [3]:
dict1 = { 'Name' : ["Priyang", "Aadhiya", "Krisha", "Vedant", "Parshv", "Mittal", "Archana"], 
         "Marks" : [98,89,99,87, 90, 83, 99],
         "Gender" : ["Male", "Female", "Female", "Male", "Male", "Female", "Female" ] 
        }

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
#Dispplaying top 3 rows of the data frame
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female

In [7]:
#check last 3 rows of the dataset
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
#find the shape of the dataset...shape is an attribute
df1.shape

(7, 3)

In [10]:
print ("Number of rows", df1.shape[0])
print ("Number of columns", df1.shape[1])

Number of rows 7
Number of columns 3

In [11]:
#Displaying information about the dataset like total number of rows , total no of columns, datatypes of each column, and memory requirements
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [16]:
#checking for null values in the data set
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [18]:
#Get overall statstics about the dataframe
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [20]:
df1.describe(include = "all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [22]:
#Find unique values from the gender column
df1["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [24]:
#FIND THE NUMBER OF UNIQUE VALUES FROM THE GENDER COLUMN
df1["Gender"].nunique()

2

In [26]:
#Display count of unique values in Gender column
df1["Gender"].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [27]:
#find total no of students having marks betweeen 90 to 100 using Between method
df1[df1["Marks"]>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [30]:
df1[(df1["Marks"] >= 90) & (df1 ["Marks"]<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [31]:
len(df1[(df1["Marks"] >= 90) & (df1 ["Marks"]<=100)])

4

In [33]:
sum(df1["Marks"].between(90,100))

4

In [34]:
#find average marks
df1["Marks"].mean()

92.14285714285714

In [39]:
#Apply method
def marks (x):
    return x//2#float div no decomals

In [40]:
df1["Half marks"] = df1["Marks"].apply(marks)

In [41]:
df1

      Name  Marks  Gender  Half marks
0  Priyang     98    Male          49
1  Aadhiya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [43]:
#using lambda function
df1["Marks"].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [45]:
#length of strings IN NAME COLUMN
df1["Name"] . apply(len)

0    7
1    7
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [47]:
#Map function
df1["Male_Female"] = df1['Gender'].map({"Male" : 1, "Female" :0})

In [48]:
df1

      Name  Marks  Gender  Half marks  Male_Female
0  Priyang     98    Male          49            1
1  Aadhiya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [50]:
#dropping the last 2 columns
#df1.drop("Male_Female", axis = 1)...for one column
df1.drop(["Male_Female", "Half marks"], axis = 1)

      Name  Marks  Gender
0  Priyang     98    Male
1  Aadhiya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [51]:
#Print names of the columns
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half marks', 'Male_Female'], dtype='object')

In [52]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [53]:
#Sort the df as per the marks column
df1.sort_values(by = "Marks", ascending = False)

      Name  Marks  Gender  Half marks  Male_Female
2   Krisha     99  Female          49            0
6  Archana     99  Female          49            0
0  Priyang     98    Male          49            1
4   Parshv     90    Male          45            1
1  Aadhiya     89  Female          44            0
3   Vedant     87    Male          43            1
5   Mittal     83  Female          41            0

In [55]:
df1.sort_values(by = ["Marks", "Gender"], ascending = False)

      Name  Marks  Gender  Half marks  Male_Female
2   Krisha     99  Female          49            0
6  Archana     99  Female          49            0
0  Priyang     98    Male          49            1
4   Parshv     90    Male          45            1
1  Aadhiya     89  Female          44            0
3   Vedant     87    Male          43            1
5   Mittal     83  Female          41            0

In [58]:
#display name and marks of female students
df1[df1["Gender"] == "Female"] [["Name", "Marks"]]

      Name  Marks
1  Aadhiya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [59]:
df1[df1["Gender"].isin(['Female'])]

      Name  Marks  Gender  Half marks  Male_Female
1  Aadhiya     89  Female          44            0
2   Krisha     99  Female          49            0
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [8]:
import pandas as pd
import numpy as np
import seaborn as sns

In [9]:
data = pd.read_csv("Documents/customer_data.csv")
data.head()

,id,age,gender,income,education,region,loyalty_status,purchase_frequency,purchase_amount,product_category,promotion_usage,satisfaction_score
0,1,27,Male,40682,Bachelor,East,Gold,frequent,18249,Books,0,6
1,2,29,Male,15317,Masters,West,Regular,rare,4557,Clothing,1,6
2,3,37,Male,38849,Bachelor,West,Silver,rare,11822,Clothing,0,6
3,4,30,Male,11568,HighSchool,South,Regular,frequent,4098,Food,0,7
4,5,31,Female,46952,College,North,Regular,occasional,19685,Clothing,1,5

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 12 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  100000 non-null  int64
 1   age                 100000 non-null  int64
 2   gender              100000 non-null  object
 3   income              100000 non-null  int64
 4   education           100000 non-null  object
 5   region              100000 non-null  object
 6   loyalty_status      100000 non-null  object
 7   purchase_frequency  100000 non-null  object
 8   purchase_amount     100000 non-null  int64
 9   product_category    100000 non-null  object
 10  promotion_usage     100000 non-null  int64
 11  satisfaction_score  100000 non-null  int64
dtypes: int64(6), object(6)
memory usage: 9.2+ MB

## THE END ##